# OpenStringerConflictNosing Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OpeningFailures..::..OpenStringerConflictNosing Property
BuiltInFailures..::..OpeningFailures Class See Also
---
Open stringer can't be created for selected nosing profile. Set nosing profile to default to get open stringers created.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId OpenStringerConflictNosing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OpenStringerConflictNosing As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ OpenStringerConflictNosing {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..OpeningFailures Class
Autodesk.Revit.DB Namespace